[
  {
    "imagePath": "https://ik.imagekit.io/nmflz4kyi2/Products_images/laptop.jpeg?updatedAt=1736581390644",
    "name": "ASUS Vivobook Intel Core i3 12th Gen 1215U - (8 GB/512 GB SSD/Windows 11 Home) X1504ZA-NJ325WS Thin and Light Laptop (15.6 Inch, Quiet Blue, 1.70 kg, With MS Office)",
    "offer": "36% off",
    "oldPrice": "₹54,990",
    "price": "₹34,990",
    "rating": "4.3⋆",
    "spec": [
      "Stylish & Portable Thin and Light Laptop",
      "15.6 Inch Full HD, 16:9 Aspect Ratio, LED Backlit, 60Hz Refresh Rate, Brightness: 250nits, 45% NTSC Color Gamut, Anti-glare Display, TUV Rheinland Certified, Screen-to-Body Ratio: 84%",
      "Light Laptop without Optical Disk Drive"
    ],
    "stock": 20
  },
  {
    "imagePath": "https://ik.imagekit.io/nmflz4kyi2/Products_images/watch.webp?updatedAt=1736581383782",
    "name": "Noise Icon 4 with Stunning 1.96'' AMOLED Display, Metallic Finish, BT Calling Smartwatch (Midnight Gold Strap, Regular)",
    "offer": "71% off",
    "oldPrice": "₹6,999",
    "price": "₹1,999",
    "rating": "4.1⋆",
    "spec": [
      "1.96\" AMOLED display with Always on Display: Larger than life visuals encapsulated within a stunning, vibrant display, makes for all eyes on the screen.",
      "Noise Health Suite: Your health and wellness champion, boasting of meticulous data tracking across metrics such as heart rate monitoring, sleep monitoring, stress monitoring, and much more.",
      "AI Voice Assistance: Watching and learning is old news. How about an in-ear expert instead? AI Voice Assistance enabled for convenience at a tap.",
      "QR Code Payments: Get instantaneous payments at a flick of your wrist. Password Protection: Your data, safe within your hands. Stay secure with enabled password protection.",
      "Up to 7 days of battery: Fresh on the juice that goes on and on, and lasts up to 2 days with BT calling.",
      "With Call Function",
      "Touchscreen",
      "Fitness & Outdoor",
      "Battery Runtime: Upto 7 days"
    ],
    "stock": 20
  },
  {
    "description": "Earboss UPGRADED VERSION M19 TWS Wireless Headphones with Cancellation and Extra Bass Fit-in Ear Earphones are the current generation earphones with 9D Hifi Sound Quality and a 2000 mAh Battery and they also can be used as POWER BANK to charge up your Smartphones. The True wireless headphones Bluetooth V5.1 earphones headphones come with phone charging support and power bank support earphones wireless headphones are loaded with Bluetooth 5.1 chipset technology which provides stable and smooth connectivity support and it covers the distance up to 10 meters and it also has quick paring technology to catch your smartphones or tablet in mini seconds time.",
    "imagePath": "https://ik.imagekit.io/nmflz4kyi2/Products_images/airbuds.webp?updatedAt=1736581387353",
    "name": "Earboss M19 Earbuds/TWS/ 5.1 with 280H Playtime, Headphones with Power Bank Bluetooth Headset (Black, True Wireless)",
    "offer": "93% off",
    "oldPrice": "₹7,999",
    "price": "₹499",
    "rating": "3.4⋆",
    "spec": [
      "With Mic:Yes",
      "Bluetooth version: 5.1",
      "Wireless range: 10 m",
      "Battery life: 10000 hr | Charging time: 1.5 Hours"
    ],
    "stock": 30
  },
  {
    "imagePath": "https://ik.imagekit.io/nmflz4kyi2/Products_images/mouse.webp?updatedAt=1736581380267",
    "name": "Razer Basilisk V3 Pro Customizable - HyperScroll Tilt Wheel - RZ01-04620100-R3A1 Wireless Optical Gaming Mouse with Bluetooth (Classic Black)",
    "offer": "34% off",
    "oldPrice": "₹27,999",
    "price": "₹18,399",
    "rating": "4.7⋆",
    "spec": [
      "Wireless",
      "For Gaming",
      "Interface: Bluetooth",
      "Optical Mouse"
    ],
    "stock": 30
  },
  {
    "brand": "PARA HILLS",
    "description": "Combo Pack Of 2 Half Sleeeves T-shirt | Polyester RoundNeck TheBoys + Live Like a King T-shirts | Red & Maroon Fabric : Cotton Sleeve Length : Short Sleeves Pattern : Printed Net Quantity (N) : 2 Sizes : S (Chest Size : 36 in, Length Size: 27 in) M (Chest Size : 38 in, Length Size: 28 in) L (Chest Size : 40 in, Length Size: 29 in) XL (Chest Size : 42 in, Length Size: 30 in) XXL (Chest Size : 44 in, Length Size: 31 in) Combo Pack of 2 TheBoys + Live Like a King Printed Regular Fit Half Sleeves T-shirt | Cotton Blend RoundNeck Casual Wear T-shirts.",
    "imagePath": "https://ik.imagekit.io/nmflz4kyi2/Products_images/T-Shirt.webp?updatedAt=1736581366253",
    "name": "Pack of 2 Men Printed Round Neck Polyester Multicolor T-Shirt",
    "offer": "70% off",
    "oldPrice": "₹999",
    "price": "₹293",
    "rating": "3.9⋆",
    "stock": 50
  },
  {
    "brand": "ARUJI FASHION",
    "description": "All you need is the Added Essence to your Fashion. This Classic Shirt in Full Sleeves is well-crafted using a 135 GSM fabric made with 100% Cotton in a Woven Pattern which makes it perfect for styling your Casual Summer Outfits for every occasion. FEATURES BREATHABILITY: The Cotton material makes it Breathable and provides Better AirFlow to the body for keeping you Cool in the Hot Season. UTMOST COMFORT: Designed for making your Summer Wear even more comfortable. The Cotton Material of this Shirt adds the softness to the fabric. MOISTURE ABSORBENT: Along with Breathability, it resolves the problem of Sweating in the Summers by making it Moisture Absorbent. HIGHLY DURABLE: This Shirt is made using Durable Cotton material making it long-lasting.",
    "imagePath": "https://ik.imagekit.io/nmflz4kyi2/Products_images/shirt.webp?updatedAt=1736581377041",
    "name": "Men Regular Fit Solid Spread Collar Casual Shirt",
    "offer": "77% off",
    "oldPrice": "₹1,663",
    "price": "₹374",
    "rating": "3.7⋆",
    "stock": 50
  },
  {
    "brand": "BRUTON",
    "description": "Providing you with the flexibility of adjusting the fit of the shoes as per your comfort and style, these shoes feature a lace closure. With the help of lace closure, you can easily tighten or loosen the fit of the shoes and make sure that there is enough flexibility of movement.",
    "imagePath": "https://ik.imagekit.io/nmflz4kyi2/Products_images/shoes.webp?updatedAt=1736581370076",
    "name": "Lite Sports Running Shoes For Men (Grey , 6)",
    "offer": "80% off",
    "oldPrice": "₹2,499",
    "price": "₹499",
    "rating": "3.9⋆",
    "stock": 50
  },
  {
    "brand": "DISHWA FASHION",
    "description": "Kurta Fabric: Chanderi Silk Bottomwear Fabric: Chanderi Silk Fabric: Chanderi Silk Sleeve Length: Three-Quarter Sleeves Set Type: Kurta With Dupatta And Bottomwear Bottom Type: Pants Pattern: Printed Sizes: S (Bust Size: 36 in, Shoulder Size: 14.5 in, Kurta Waist Size: 34 in, Kurta Hip Size: 40 in, Kurta Length Size: 42 in, Bottom Waist Size: 27 in, Bottom Length Size: 37 in, Duppatta Length Size: 2.1 m) XL (Bust Size: 42 in, Shoulder Size: 16 in, Kurta Waist Size: 40 in, Kurta Hip Size: 46 in, Kurta Length Size: 42 in, Bottom Waist Size: 32 in, Bottom Length Size: 37",
    "imagePath": "https://ik.imagekit.io/nmflz4kyi2/Products_images/women-outfit.webp?updatedAt=1736581363045",
    "name": "Women Chanderi Kurta Pant Dupatta Set",
    "offer": "64% off",
    "oldPrice": "₹2,099",
    "price": "₹749",
    "rating": "4.2⋆",
    "stock": 50
  },
  {
    "imagePath": "https://ik.imagekit.io/nmflz4kyi2/Products_images/bed.jpeg?updatedAt=1736581352705",
    "name": "Flipkart Perfect Homes Opus Engineered Wood Queen Box Bed (Finish Color - American Espresso, Delivery Condition - Knock Down)",
    "offer": "60% off",
    "oldPrice": "₹27,999",
    "price": "₹10,999",
    "rating": "3.0⋆",
    "spec": [
      "Bed Material Subtype: Particle Board",
      "W x H x D: 162.052 cm x 79.75 cm x 213.106 cm (5 ft 3 in x 2 ft 7 in x 6 ft 11 in)",
      "Storage Type: Box",
      "Delivery Condition: Knock Down - Delivered in non-assembled pieces, installation by service partner"
    ]
  },
  {
    "imagePath": "https://ik.imagekit.io/nmflz4kyi2/Products_images/sofa.webp?updatedAt=1736581373666",
    "name": "LIVEWELL Premium Quality L Shape RHS With Center Table and Puffy Molfino Fabric 8 Seater Sofa (Finish Color - Aqua Blue, DIY(Do-It-Yourself))",
    "offer": "38% off",
    "oldPrice": "₹38,999",
    "price": "₹23,999",
    "rating": "3.0⋆",
    "spec": [
      "Upholestry: Chenille",
      "Filling Material: Foam",
      "W x H x D: 183 cm x 73 cm x 76 cm (6 ft x 2 ft 4 in x 2 ft 5 in)",
      "Right Facing",
      "Delivery Condition: DIY - Basic assembly to be done with simple tools by the customer, comes with instructions.",
      "1 Year manufacturer Warranty"
    ],
    "stock": 30
  },
  {
    "imagePath": "https://ik.imagekit.io/nmflz4kyi2/Products_images/fridge.webp?updatedAt=1736581349499",
    "name": "SAMSUNG 215 L Direct Cool Single Door 5 Star Refrigerator with Digital Inverter (Paradise Bloom Blue, RR23D2H359U/HL)",
    "offer": "35% off",
    "oldPrice": "₹30,999",
    "price": "₹19,990",
    "rating": "4.4⋆",
    "spec": [
      "215 L : Good for couples and small families",
      "Digital Inverter Compressor",
      "5 Star : For Energy savings up to 55%",
      "Direct Cool : Economical, consumes less electricity, requires manual defrosting"
    ],
    "stock": 30
  },
  {
    "description": "The Samsung 8 kg fully automatic front-load washing machine is a perfect choice for a small family of 4 or 5. It comes with various features to suit your everyday washing needs, including Eco Bubble technology, AI-controlled washing, steam washing, and more. The Eco Bubble technology makes use of bubbles which quickly penetrate the clothes to remove dirt and tough stains effectively. This washing machine remembers your washing routine and allows you to personalise your washing by suggesting cycles suitable for your needs. The powerful steam wash cycle of this washing machine helps to remove germs and stubborn dirt from your clothes.",
    "imagePath": "https://ik.imagekit.io/nmflz4kyi2/Products_images/washing%20Machine.webp?updatedAt=1736581356043",
    "name": "SAMSUNG 8 kg Fully Automatic Front Load Washing Machine with In-built Heater Black, Grey (WW80T504DAX1TL)",
    "offer": "35% off",
    "oldPrice": "₹55,900",
    "price": "₹35,990",
    "rating": "4.4⋆",
    "spec": [
      "Fully Automatic Front Load Washing Machines have Great Wash Quality with very less running cost",
      "1400 rpm : Higher the spin speed, lower the drying time",
      "5 Star Rating",
      "8 kg"
    ],
    "stock": 30
  },
  {
    "description": "Experience the iPhone 15 – your dynamic companion. Dynamic Island ensures you stay connected, bubbling up alerts seamlessly while you're busy. Its durable design features infused glass and aerospace-grade aluminum, making it dependable and resistant to water and dust. Capture life with precision using the 48 MP Main Camera, perfect for any shot. Powered by the A16 Bionic Processor, it excels in computational photography and more, all while conserving battery life. Plus, it's USB-C compatible, simplifying your charging needs. Elevate your tech game with the iPhone 15 – innovation at your fingertips. Goodbye cable clutter, hello convenience.",
    "imagePath": "https://ik.imagekit.io/nmflz4kyi2/Products_images/iphone.webp?updatedAt=1736581345699",
    "name": "Apple iPhone 15 (Black, 128 GB)",
    "offer": "17% off",
    "oldPrice": "₹79,600",
    "price": "₹65,499",
    "rating": "4.6⋆",
    "spec": [
      "128 GB ROM",
      "15.49 cm (6.1 inch) Super Retina XDR Display",
      "48MP + 12MP | 12MP Front Camera",
      "A16 Bionic Chip, 6 Core Processor Processor"
    ],
    "stock": 50
  },
  {
    "description": "NA",
    "imagePath": "https://ik.imagekit.io/nmflz4kyi2/Products_images/moto.webp?updatedAt=1736581359426",
    "name": "Motorola g64 5G (Pearl Blue, 128 GB) (8 GB RAM)",
    "offer": "22% off",
    "oldPrice": "₹17,999",
    "price": "₹13,999",
    "rating": "4.2⋆",
    "spec": [
      "8 GB RAM | 128 GB ROM | Expandable Upto 1 TB",
      "16.51 cm (6.5 inch) Full HD+ Display",
      "50MP (OIS) + 8MP | 16MP Front Camera",
      "6000 mAh Battery",
      "Dimensity 7025 Processor"
    ],
    "stock": 50
  },
  {
    "description": "Give yourself a smartphone that recognises your emotions and responds appropriately. The Samsung Galaxy S23 5G's enhanced AI and Nightography feature produces low-light photos and videos that are vivid and colourful from dusk to dawn and back again. The Snapdragon processor in this phone also offers quick video streaming and gaming. Additionally, adaptive 120 Hz makes scrolling fluid, and Eye Comfort Shield guards against eye fatigue even while looking in low light.",
    "imagePath": "https://ik.imagekit.io/nmflz4kyi2/Products_images/samsung.webp?updatedAt=1736581250904",
    "name": "SAMSUNG Galaxy S23 5G (Phantom Black, 128 GB) (8 GB RAM)",
    "offer": "50% off",
    "oldPrice": "₹89,999",
    "price": "₹44,999",
    "rating": "4.5⋆",
    "spec": [
      "8 GB RAM | 128 GB ROM",
      "15.49 cm (6.1 inch) Full HD+ Display",
      "50MP + 10MP + 12MP | 12MP Front Camera",
      "3900 mAh Lithium Ion Battery",
      "Qualcomm Snapdragon 8 Gen 2 Processor"
    ],
    "stock": 50
  },
  {
    "description": "NA",
    "imagePath": "https://ik.imagekit.io/nmflz4kyi2/Products_images/oppo.webp?updatedAt=1736581340791",
    "name": "OPPO K12x 5G with 45W SUPERVOOC Charger In-The-Box (Breeze Blue, 256 GB) (8 GB RAM)",
    "offer": "15% off",
    "oldPrice": "₹18,999",
    "price": "₹15,999",
    "rating": "4.5⋆",
    "spec": [
      "8 GB RAM | 256 GB ROM | Expandable Upto 1 TB",
      "16.94 cm (6.67 inch) HD Display",
      "32MP + 2MP | 8MP Front Camera",
      "5100 mAh Battery",
      "Dimensity 6300 Processor"
    ],
    "stock": 50
  } 
]
